//aly
import QtQuick
import QtQuick.Dialogs


Item {
    property alias about: _about
    property alias rule: _rule

    MessageDialog {
        id: _about
        modality: Qt.WindowModal
        buttons: MessageDialog.Ok
        text: "<b>开发团队介绍</b><br>"+"<b>开发成员:</b> 彭家乐,艾乐妍,黄棪峰<br>"
              + "<b>学号:</b> 2022051615028,2022051615100,2022051615094<br><br>"

    }

    MessageDialog {
        id: _rule
        modality: Qt.WindowModal
        title: "游戏规则"
        buttons: MessageDialog.Ok

        text: "<b>1. 游戏准备：</b><br>" +
              "<b>(1) 每名玩家准备四颗棋子，分别放在自己的起点。</b><br>" +
              "<b>(2) 每人轮流掷一次骰子，根据点数决定自己的行进距离。</b><br>" +
              "<b>(3) 从左到右从上到下依次为绿、红、橙、蓝四组，每组先到达终点的胜利。</b><br>" +
              "<b>(4) 每名玩家选择自己的颜色方进入游戏。</b><br>" +
              "2. 行进规则：<br>"+
                      "<b>(1)人机自动摇骰子并进行移动。轮到用户顺序时需要用户自己掷骰子即点击骰子，按照点数选择自己颜色方的棋子向前移动相应的距离。</b><br>" +
                      "<b>(2)如果您棋子的目标位置与对方的棋子相同，可以将对方棋子撞出界外而回到起点。</b><br>" +
                      "<b> (3)如果您的棋子被对方棋子撞出界外，则需要从起点重新开始。</b><br>" +
                      "3. 特殊位置：<br>" +
                                    "<b> (1)游戏中会有一些特殊的位置，与棋子颜色相同，当目标位置颜色与自己棋子相同则可实现一次跳跃，到达下一个与自己棋子相同颜色的位置。</b><br>" +
                                    "<b> (2)在路径过程中每个棋子有一个快捷位置与自己颜色相同的三角形位置，实现在地图中沿虚线跳跃到相同颜色的下一个三角形位置。</b><br>" +
                                    "4.胜利条件：<br>" +
        "<b> (1)当您的四颗棋子都成功到达基地时，即视为胜利。</b><br>" +
        "<b>(2)所有出发点显示到达标志，出现胜利提示消息。</b><br>"
    }


}
